
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// Проверка, проведен ли текущий документ, для запрета перепрведения	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТарифыКоммунальныхУслуг.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ТарифыКоммунальныхУслуг КАК ТарифыКоммунальныхУслуг
		|ГДЕ
		|	ТарифыКоммунальныхУслуг.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = 
		"Повторное проведение документа запрещено. Для изменения необходимо сначала отменить проведение.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	
	// регистр ТарифыКоммунальныхУслуг
	Движения.ТарифыКоммунальныхУслуг.Записывать = Истина;
	Для Каждого Строка Из СписокТарифов Цикл
		Движение = Движения.ТарифыКоммунальныхУслуг.Добавить();
		Движение.Период = ДатаНачалаДействия;
		Движение.ВидПлатежа = Строка.ВидПлатежа;
		Движение.Тариф = Строка.Тариф;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#КонецЕсли

