
Процедура ОбработкаПроведения(Отказ, Режим)
	
	 	//проверка, существует ли платеж за этот месяц	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаИнтернет.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцДокумента,
		|	СведенияПоИнтернету.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцРегистратора
		|ИЗ
		|	РегистрСведений.СведенияПоИнтернету КАК СведенияПоИнтернету
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаИнтернет КАК ОплатаИнтернет
		|		ПО СведенияПоИнтернету.ОплачиваемыйМесяц = ОплатаИнтернет.ОплачиваемыйМесяц
		|ГДЕ
		|	ОплатаИнтернет.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой()Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Платеж за " + ОплачиваемыйМесяц + " уже проведен";
		Сообщение.Сообщить();
	КонецЕсли;
	
	// регистр СведенияПоИнтернету
	Движения.СведенияПоИнтернету.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеПлатежа Из ДанныеПлатежа Цикл
		Движение = Движения.СведенияПоИнтернету.Добавить();
		Движение.Период = Дата;
		Движение.ОплачиваемыйМесяц = ОплачиваемыйМесяц;
		Движение.ЦенаИнтернет = ТекСтрокаДанныеПлатежа.ЦенаИнтернет;
		Если ДопУслугиИнтернетВыбор = Истина Тогда 
		     Движение.ДопУслугиИнтернет = ТекСтрокаДанныеПлатежа.ЦенаДопУслугиИнтернет;
	    Иначе 
		     Движение.ДопУслугиИнтернет = 0;
		КонецЕсли;
		 
		Движение.Сумма = ТекСтрокаДанныеПлатежа.СуммаПлатежа;
		Движение.КодМесяцаОплаты = ОплачиваемыйМесяц.Код;
	КонецЦикла;

КонецПроцедуры
