
&НаСервере
Процедура ЗаполнениеШапкиНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПлатежей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыПлатежей.Счетчик КАК Счетчик,
		|	ВидыПлатежей.Счетчик.Номер КАК СчетчикНомер,
		|	ВидыПлатежей.Счетчик.ДатаУстановки КАК СчетчикДатаУстановки
		|ИЗ
		|	Справочник.ВидыПлатежей КАК ВидыПлатежей
		|ГДЕ
		|	ВидыПлатежей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ВидПлатежа);
	//Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Если Не РезультатЗапроса.Пустой() Тогда
		 Объект.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		 Объект.Счетчик = Выборка.Счетчик;
		 Объект.НомерСчетчика = Выборка.СчетчикНомер;
		 Объект.ДатаУстановки = Выборка.СчетчикДатаУстановки;
	 Иначе 
		 Сообщить("Ошибка.Заполните справочники в настройках")
	 КонецЕсли;
	 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеШапкиНаСервере();
	Если Объект.ДанныеПлатежа.Количество() = 0 Тогда
		Элементы.ДанныеПлатежа.ДобавитьСтроку();
		КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ЗаполнениеТЧНаСервере()
	
	 //получаем код поледних показаний, для формирования крайних показаний
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияПоГазоснабжениюСрезПоследних.КодМесяцаОплаты КАК КодМесяцаОплаты
		|ИЗ
		|	РегистрСведений.СведенияПоГазоснабжению.СрезПоследних КАК СведенияПоГазоснабжениюСрезПоследних";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Индекс = Выборка.КодМесяцаОплаты;
	Если Индекс = 0 Тогда 
		ИндексМесяца = Индекс;
	Иначе
		ИндексМесяца = Число(Объект.ОплачиваемыйМесяц.Код)- 1;
	КонецЕсли;
	
	//получаем крайние показания счетчиков, на основе полученного выше ИндексМесяца
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СведенияПоГазоснабжениюСрезПоследних.ТекущиеПоказания,0) КАК ТекущиеПоказания,
		|	ЕСТЬNULL(СведенияПоГазоснабжениюСрезПоследних.ПоказанияНачисления,0) КАК ПоказанияНачисления
		|ИЗ
		|	РегистрСведений.СведенияПоГазоснабжению.СрезПоследних КАК СведенияПоГазоснабжениюСрезПоследних
		|ГДЕ
		|	СведенияПоГазоснабжениюСрезПоследних.КодМесяцаОплаты = &КодМесяцаОплаты";
	
	Запрос.УстановитьПараметр("КодМесяцаОплаты", ИндексМесяца);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Если Не РезультатЗапроса.Пустой()Тогда	
	   ПоказанияНачисления = Выборка.ТекущиеПоказания;
	   СтарыеПоказания = Выборка.ПоказанияНачисления;
   	Иначе
	   Сообщить("Проверьте установку начальных показаний счетчиков");

    КонецЕсли;
   
    // получаем актуальную цену по газаснабжению
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныКомунальныхУслугСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныКомунальныхУслуг.СрезПоследних(
		|			,
		|			ВидПлатежа = &ВидПлатежа
		|				И КодМесяца <= &КодМесяца) КАК ЦеныКомунальныхУслугСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидПлатежа", Объект.ВидПлатежа);
	Запрос.УстановитьПараметр("КодМесяца", Число(Объект.ОплачиваемыйМесяц.Код));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	 Выборка.Следующий();
	 Если Не РезультатЗапроса.Пустой()Тогда
        Цена = Выборка.Цена;
	Иначе
		Сообщить("Цена не найдена");
	КонецЕсли;
	
   
      ДанныеПоказаний = Новый Структура;
	  ДанныеПоказаний.Вставить("ПоказанияНачисления",ПоказанияНачисления);
	  ДанныеПоказаний.Вставить("СтарыеПоказания",СтарыеПоказания);
	  ДанныеПоказаний.Вставить("Цена",Цена);
	  Возврат ДанныеПоказаний;
	
КонецФункции



&НаКлиенте
Процедура ОплачиваемыйМесяцПриИзменении(Элемент)
	Показания = ЗаполнениеТЧНаСервере();
	ТекДан = Элементы.ДанныеПлатежа.ТекущиеДанные;
	ТекДан.ПоказанияНачисления = Показания.ПоказанияНачисления;
	ТекДан.СтарыеПоказания = Показания.СтарыеПоказания;
	ТекДан.Цена = Показания.Цена;
	Если ТекДан.ПоказанияНачисления и  ТекДан.СтарыеПоказания <> Неопределено Тогда
		ТекДан.Количество  =  ТекДан.ПоказанияНачисления - ТекДан.СтарыеПоказания;	
		ТекДан.СуммаПлатежа = ТекДан.Количество * ТекДан.Цена * 0.001;
	КонецЕсли;
КонецПроцедуры

// РАБОТА С КАРТИНКАМИ

&НаКлиенте
Асинх Процедура ЗагрузитьКвитанцию(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		ИзображениеКвитанция = ОбещаниеФайла.Адрес;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ИзображениеКвитанция) Тогда
		ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеКвитанция));
    ИначеЕсли ИзображениеКвитанция ="Очистить" Тогда
		ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(ИзображениеЧек) Тогда
		ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеЧек));
    ИначеЕсли ИзображениеЧек ="Очистить" Тогда
		ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;

	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИзображениеКвитанция = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"КвитанцияИзображение");
	ИзображениеЧек = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ЧекИзображение");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКвитанцию(Команда)
	
	ИзображениеКвитанция = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьЧек(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		ИзображениеЧек = ОбещаниеФайла.Адрес;
		Модифицированность = Истина;
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЧек(Команда)
	ИзображениеЧек = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры



