
#Область ПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// Контактная информация справочника "Поставщики" 
    ЭлементПоставщик = Элементы.Добавить(); 
    ЭлементПоставщик.ИмяПредопределенногоВида = "СправочникПоставщики";
    ЭлементПоставщик.ЭтоГруппа = Истина;
    ЭлементПоставщик.Используется = Истина;
    ЭлементПоставщик.Наименование = 
    	НСтр("ru = 'Контактная информация справочника ""Поставщики""'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Телефон поставщика
    ЭлементПоставщик = Элементы.Добавить();
    ЭлементПоставщик.Родитель = "СправочникПоставщики";
    ЭлементПоставщик.ИмяГруппы = "СправочникПоставщики";
    ЭлементПоставщик.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
    ЭлементПоставщик.Используется = Истина;
    ЭлементПоставщик.ИмяПредопределенногоВида = "ТелефонПоставщика";
    ЭлементПоставщик.ИдентификаторДляФормул = "ТелефонПоставщика";
    ЭлементПоставщик.ВидРедактирования = "ПолеВвода";
    ЭлементПоставщик.ОтображатьВсегда = Истина;
    ЭлементПоставщик.Наименование = НСтр("ru = 'Телефон'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Адрес электронной почты Поставщика
    ЭлементПоставщик = Элементы.Добавить();
    ЭлементПоставщик.Родитель = "СправочникПоставщики";
    ЭлементПоставщик.ИмяГруппы = "СправочникПоставщики";
    ЭлементПоставщик.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
    ЭлементПоставщик.Используется = Истина;
    ЭлементПоставщик.ИмяПредопределенногоВида = "ЭлектроннаяПочтаПоставщика";
    ЭлементПоставщик.ИдентификаторДляФормул = "ЭлектроннаяПочтаПоставщика";
    ЭлементПоставщик.ВидРедактирования = "ПолеВвода";
    ЭлементПоставщик.ОтображатьВсегда = Истина;
    ЭлементПоставщик.Наименование = НСтр("ru = 'E-mail'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Сайт поставщика
    ЭлементПоставщик = Элементы.Добавить();
    ЭлементПоставщик.Родитель = "СправочникПоставщики";
    ЭлементПоставщик.ИмяГруппы = "СправочникПоставщики";
    ЭлементПоставщик.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
    ЭлементПоставщик.Используется = Истина;
    ЭлементПоставщик.ИмяПредопределенногоВида = "СайтПоставщика";
    ЭлементПоставщик.ИдентификаторДляФормул = "СайтПоставщика";
    ЭлементПоставщик.ВидРедактирования = "ПолеВвода";
    ЭлементПоставщик.ОтображатьВсегда = Истина;
    ЭлементПоставщик.Наименование = НСтр("ru = 'Сайт'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	
	
	// Контактная информация справочника "СоставСемьи" 
    ЭлементСоставСемьи = Элементы.Добавить(); 
    ЭлементСоставСемьи.ИмяПредопределенногоВида = "СправочникСоставСемьи";
    ЭлементСоставСемьи.ЭтоГруппа = Истина;
    ЭлементСоставСемьи.Используется = Истина;
    ЭлементСоставСемьи.Наименование = 
    	НСтр("ru = 'Контактная информация справочника ""СоставСемьи""'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Телефон домочадца
    ЭлементСоставСемьи = Элементы.Добавить();
    ЭлементСоставСемьи.Родитель = "СправочникСоставСемьи";
    ЭлементСоставСемьи.ИмяГруппы = "СправочникСоставСемьи";
    ЭлементСоставСемьи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
    ЭлементСоставСемьи.Используется = Истина;
    ЭлементСоставСемьи.ИмяПредопределенногоВида = "ТелефонДомочадца";
    ЭлементСоставСемьи.ИдентификаторДляФормул = "ТелефонДомочадца";
    ЭлементСоставСемьи.ВидРедактирования = "ПолеВвода";
    ЭлементСоставСемьи.ОтображатьВсегда = Ложь;
    ЭлементСоставСемьи.Наименование = НСтр("ru = 'Телефон'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Адрес электронной почты домочадца
    ЭлементСоставСемьи = Элементы.Добавить();
    ЭлементСоставСемьи.Родитель = "СправочникСоставСемьи";
    ЭлементСоставСемьи.ИмяГруппы = "СправочникСоставСемьи";
    ЭлементСоставСемьи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
    ЭлементСоставСемьи.Используется = Истина;
    ЭлементСоставСемьи.ИмяПредопределенногоВида = "ЭлектроннаяПочтаДомочадца";
    ЭлементСоставСемьи.ИдентификаторДляФормул = "ЭлектроннаяПочтаДомочадца";
    ЭлементСоставСемьи.ВидРедактирования = "ПолеВвода";
    ЭлементСоставСемьи.ОтображатьВсегда = Ложь;
    ЭлементСоставСемьи.Наименование = НСтр("ru = 'E-mail'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецПроцедуры


#КонецОбласти


