

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
//	Если Объект.НачальныеПоказания.Количество() = 0 Тогда
//		Элементы.НачальныеПоказания.ДобавитьСтроку();
//	КонецЕсли;
	ПриОткрытииНаСервере();
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КрайнийОплаченныйМесяцПриИзменении(Элемент)
	ВыбранныйМесяц = Объект.КрайнийОплаченныйМесяц;
	ВыбранныйГод = Объект.ГодПлатежа;
	
	СлужебнаяДата = РаботаСДокументамиСерверУД.РассчитатьСлужебнуюДату(ВыбранныйМесяц, ВыбранныйГод);
	Объект.КрайнийОплаченныйПериодСлужебный = СлужебнаяДата;
КонецПроцедуры

&НаКлиенте
Процедура ГодПлатежаПриИзменении(Элемент)
	ВыбранныйМесяц = Объект.КрайнийОплаченныйМесяц;
	ВыбранныйГод = Объект.ГодПлатежа;
	
	СлужебнаяДата = РаботаСДокументамиСерверУД.РассчитатьСлужебнуюДату(ВыбранныйМесяц, ВыбранныйГод);
	Объект.КрайнийОплаченныйПериодСлужебный = СлужебнаяДата;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ГодПлатежа = Год(ТекущаяДатаСеанса());
//	КонецЕсли;
	
//	Если Объект.НачальныеПоказания.Количество() = 0 Тогда
		Объект.НачальныеПоказания.Добавить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти



