
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
    
   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, 
   											Метаданные.Отчеты.ИсторияПлатежей, "Основной");
   НастройкиВарианта.Описание = НСтр("ru = 'Снимок всех платежных данных, 
   										|по виду платежа, за выбранный период, с итогами.'");

	НастройкиВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы()); 
    
КонецПроцедуры
#КонецОбласти


#КонецОбласти



#КонецЕсли
