
#Область ПрограммныйИнтерфейс

//Обновление значений реквизитов видов контактной информации
Процедура АктуализироватьВидыКонтактнойИнформации () Экспорт
	
	ПараметрыОбновления = ОбновлениеИнформационнойБазы.ПараметрыОбновленияПредопределенныхЭлементов();
	ПараметрыОбновления.Реквизиты = "РазрешитьВводНесколькихЗначений, ВидРедактирования, РазрешитьВсегда, Используется";
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(Метаданные.Справочники.ВидыКонтактнойИнформации, ПараметрыОбновления);
	
КонецПроцедуры


#КонецОбласти

