
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СведенияПоГазоснабжению
	Движения.СведенияПоЭлектроснабжению.Записывать = Истина;
	Для Каждого ТекСтрокаНачальныеПоказания Из НачальныеПоказания Цикл
		Движение = Движения.СведенияПоЭлектроснабжению.Добавить();
		Движение.Период = Дата;
		Движение.ТекущиеПоказания = ТекСтрокаНачальныеПоказания.КрайниеПереданныеПоказания;
		Движение.ПоказанияНачисления = ТекСтрокаНачальныеПоказания.КрайниеОплаченныеПоказания;
		Движение.Количество = ТекСтрокаНачальныеПоказания.Количество;
		Движение.Сумма = ТекСтрокаНачальныеПоказания.СуммаПлатежа;
		Движение.КодМесяцаОплаты = 0;
	КонецЦикла;

КонецПроцедуры
