
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Возраст = Цел((ТекущаяДата() - Объект.ДатаРождения)/31557600);
	Если Возраст < 14 и Объект.УчитыватьВПлатежах = Истина Тогда
		Элементы.СтраницаПаспорт.Видимость = Ложь;	
    КонецЕсли;

	Если Объект.УчитыватьВПлатежах = Ложь Тогда
		Элементы.СтраницаПаспорт.Видимость = Ложь;
        Элементы.СтраницаСвидОРожд.Видимость = Ложь;
		Элементы.СтраницаСНИЛС.Видимость = Ложь;
		Элементы.СтраницаИНН.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


// РАБОТА С КАРТИНКАМИ

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//паспорт
	Если ЭтоАдресВременногоХранилища(ИзображениеПаспорт) Тогда
		ТекущийОбъект.ПаспортИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеПаспорт));
    ИначеЕсли ИзображениеПаспорт ="Очистить" Тогда
		ТекущийОбъект.ПаспортИзображение = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	//свид о рожд
	Если ЭтоАдресВременногоХранилища(ИзображениеСвидОРожд) Тогда
		ТекущийОбъект.СвидОРождИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеСвидОРожд));
    ИначеЕсли ИзображениеСвидОРожд ="Очистить" Тогда
		ТекущийОбъект.СвидОРождИзображение = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
    //СНИЛС
	Если ЭтоАдресВременногоХранилища(ИзображениеСНИЛС) Тогда
		ТекущийОбъект.СНИЛСИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеСНИЛС));
    ИначеЕсли ИзображениеСНИЛС ="Очистить" Тогда
		ТекущийОбъект.СНИЛСИзображение = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	//ИНН
     Если ЭтоАдресВременногоХранилища(ИзображениеИНН) Тогда
		ТекущийОбъект.ИННИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеИНН));
    ИначеЕсли ИзображениеИНН ="Очистить" Тогда
		ТекущийОбъект.ИННИзображение = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;



КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИзображениеПаспорт = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ПаспортИзображение");
	ИзображениеСвидОРожд = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"СвидОРождИзображение");
	ИзображениеСНИЛС = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"СНИЛСИзображение");
    ИзображениеИНН = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ИННИзображение");
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьПаспорт(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		ИзображениеПаспорт = ОбещаниеФайла.Адрес;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьПаспорт(Команда)
	
	ИзображениеПаспорт = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьСвидОРожд(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		ИзображениеСвидОРожд = ОбещаниеФайла.Адрес;
		Модифицированность = Истина;
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвидОРожд(Команда)
	ИзображениеСвидОРожд = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьСНИЛС(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		ИзображениеСНИЛС = ОбещаниеФайла.Адрес;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьСНИЛС(Команда)
	ИзображениеСНИЛС = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьИНН(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		ИзображениеИНН = ОбещаниеФайла.Адрес;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьИНН(Команда)
	ИзображениеИНН = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры


