
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Возраст = Цел((ТекущаяДата() - Объект.ДатаРождения)/31557600);
	Если Возраст < 14 и Объект.УчитыватьВПлатежах = Истина Тогда
		Элементы.СтраницаПаспорт.Видимость = Ложь;	
    КонецЕсли;

	Если Объект.УчитыватьВПлатежах = Ложь Тогда
		Элементы.СтраницаПаспорт.Видимость = Ложь;
        Элементы.СтраницаСвидОРожд.Видимость = Ложь;
		Элементы.СтраницаСНИЛС.Видимость = Ложь;
		Элементы.СтраницаИНН.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


// РАБОТА С КАРТИНКАМИ (Переход на документ.pdf)

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//паспорт
 
	ТекущийОбъект.ПаспортИзображение = Новый ХранилищеЗначения(ИзображениеПаспорт);
	
	//свид о рожд
	
	ТекущийОбъект.СвидОРождИзображение = Новый ХранилищеЗначения(ИзображениеСвидОРожд);
	
    //СНИЛС
	
	ТекущийОбъект.СНИЛСИзображение = Новый ХранилищеЗначения(ИзображениеСНИЛС);
	
	//ИНН
	
	ТекущийОбъект.ИННИзображение = Новый ХранилищеЗначения(ИзображениеИНН);


КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    ИзображениеПаспорт = ТекущийОбъект.ПаспортИзображение.Получить();
    ИзображениеСвидОРожд = ТекущийОбъект.СвидОРождИзображение.Получить();
	ИзображениеСНИЛС = ТекущийОбъект.СНИЛСИзображение.Получить();
    ИзображениеИНН = ТекущийОбъект.ИННИзображение.Получить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьПаспорт(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ИзображениеПаспорт.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура УдалитьПаспорт(Команда)
	ИзображениеПаспорт = Неопределено;
	УдалитьПаспортНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УдалитьПаспортНаСервере()
	
	ИзображениеПаспорт = Неопределено;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьСвидОРожд(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
//		ИзображениеСвидОРожд = ОбещаниеФайла.Адрес;
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ЭтотОбъект.ИзображениеСвидОРожд.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвидОРожд(Команда)
	ИзображениеСвидОРожд = Неопределено;
	УдалитьСвидОРождНасервере();
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Процедура УдалитьСвидОРождНасервере()

ИзображениеСвидОРожд = Неопределено;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьСНИЛС(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
//		ИзображениеСНИЛС = ОбещаниеФайла.Адрес;
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ЭтотОбъект.ИзображениеСНИЛС.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьСНИЛС(Команда)
	ИзображениеСНИЛС = Неопределено;
	УдалитьСНИЛСНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УдалитьСНИЛСНаСервере()
	ИзображениеСНИЛС = Неопределено;
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗагрузитьИНН(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
//		ИзображениеИНН = ОбещаниеФайла.Адрес;
		
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
	    Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	    ЭтотОбъект.ИзображениеИНН.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УдалитьИНН(Команда)
	ИзображениеИНН = Неопределено;
	УдалитьИНННаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура УдалитьИНННаСервере()
	ИзображениеИНН = Неопределено;
КонецПроцедуры
