

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	ПараметрыГиперссылки.Видимость = Ложь;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыПоля = РаботаСФайлами.ПолеФайла();
	ПараметрыПоля.Размещение = "ГруппаКартинка";
	ПараметрыПоля.ПутьКДанным = "Объект.ФайлКартинки";
	ПараметрыПоля.ПутьКДаннымИзображения = "АдресКартинки";
	
	ПараметрыПоляПечать = РаботаСФайлами.ПолеФайла();
	ПараметрыПоляПечать.Размещение = "ГруппаПечать";
	ПараметрыПоляПечать.ПутьКДанным = "Объект.ФайлПечати";
	ПараметрыПоляПечать.ПутьКДаннымИзображения = "АдресПечати";
	
	ПараметрыПоляПодпись = РаботаСФайлами.ПолеФайла();
	ПараметрыПоляПодпись.Размещение = "ГруппаПодпись";
	ПараметрыПоляПодпись.ПутьКДанным = "Объект.ФайлПодписи";
	ПараметрыПоляПодпись.ПутьКДаннымИзображения = "АдресПодписи";
	// Конец СтандартныеПодсистемы.РаботаСФайлами
		
	// СтандартныеПодсистемы.РаботаСФайлами
	ДобавляемыеЭлементы = Новый Массив;
	ДобавляемыеЭлементы.Добавить(ПараметрыГиперссылки);
	ДобавляемыеЭлементы.Добавить(ПараметрыПоля);
	ДобавляемыеЭлементы.Добавить(ПараметрыПоляПечать);
	ДобавляемыеЭлементы.Добавить(ПараметрыПоляПодпись);
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ДобавляемыеЭлементы);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
       
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    
    // СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами	
	
	РассчитатьИПоказатьВозрастПредставление();
	
	ПриОткрытииНаСервере();
	
	СозданиеГруппПрисоединенныхФайлов();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СозданиеГруппПрисоединенныхФайлов();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


#Область РаботаСФайлами


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
    
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	
	РассчитатьИПоказатьВозрастПредставление();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
    РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


// Создание заданных групп в ПрисоединенныеФайлы
&НаКлиенте
Процедура СозданиеГруппПрисоединенныхФайлов()
	
	//	НАЧАЛО. Создание заданных групп в ПрисоединенныеФайлы
	// Готовим параметры для вызова универсальной процедуры
	Владелец = Объект.Ссылка;
	ИмяСправочника = "СоставСемьиПрисоединенныеФайлы"; // Имя справочника присоединенных файлов для этого документа
	
	СписокГрупп = Новый Массив;
	СписокГрупп.Добавить("Изображения");
	СписокГрупп.Добавить("Документы");
	
	// Вызываем наш универсальный метод из общего модуля
	РаботаСПрисоединеннымиФайламиСерверУД.СоздатьСтандартныеГруппыПрисоединенныхФайлов(Владелец, ИмяСправочника, СписокГрупп);
	//	Конец. Создание заданных групп в ПрисоединенныеФайлы

	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере();

	Если Объект.Ссылка <> Константы.Собственник.Получить() Тогда
		Элементы.СтраницаПечать.Видимость = Ложь;
        Элементы.СтраницаПодпись.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры


// Процедура, которая обновляет поле на форме
&НаКлиенте
Процедура РассчитатьИПоказатьВозрастПредставление()
	
	ВозрастПредставление = РаботаСДатамиКлиентСерверУД.РассчитатьВозраст(Объект.ДатаРождения);
	
КонецПроцедуры


#Область ПодключаемыеКоманды


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
    
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
    
КонецПроцедуры


&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
    
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти


#КонецОбласти
