
Процедура ОбработкаПроведения(Отказ, Режим)
	//проверка, существует ли платеж за этот месяц
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаГазоснабжения.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцДокумент,
		|	СведенияПоГазоснабжению.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцСведения
		|ИЗ
		|	РегистрСведений.СведенияПоГазоснабжению КАК СведенияПоГазоснабжению
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаГазоснабжения КАК ОплатаГазоснабжения
		|		ПО СведенияПоГазоснабжению.ОплачиваемыйМесяц = ОплатаГазоснабжения.ОплачиваемыйМесяц
		|ГДЕ
		|	ОплатаГазоснабжения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Платеж за " + ОплачиваемыйМесяц + " уже проведен";
		Сообщение.Сообщить();;	
	    Отказ = Истина;
	КонецЕсли;
	
	// регистр СведенияПоГазоснабжению
	Движения.СведенияПоГазоснабжению.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеПлатежа Из ДанныеПлатежа Цикл
		Движение = Движения.СведенияПоГазоснабжению.Добавить();
		Движение.Период = Дата;
		Движение.ОплачиваемыйМесяц = ОплачиваемыйМесяц;
		Движение.ТекущиеПоказания = ТекСтрокаДанныеПлатежа.ТекущиеПоказания;
		Движение.ПоказанияНачисления = ТекСтрокаДанныеПлатежа.ПоказанияНачисления;
		Движение.СтарыеПоказания = ТекСтрокаДанныеПлатежа.СтарыеПоказания;
		Движение.Количество = ТекСтрокаДанныеПлатежа.Количество;
		Движение.Цена = ТекСтрокаДанныеПлатежа.Цена;
		Движение.Сумма = ТекСтрокаДанныеПлатежа.СуммаПлатежа;
		Движение.КодМесяцаОплаты = ОплачиваемыйМесяц.Код;
	КонецЦикла;

КонецПроцедуры
