#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Возвращает количество человек, учитываемых в платежах.
//
// Возвращаемое значение:
//  Число - КоличествоЧеловек, учитываемых в платежах.
//
Функция ПолучитьКоличествоЧеловекУчитыватьВПлатежах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СоставСемьи.Ссылка) КАК КоличествоЧеловек
		|ИЗ
		|	Справочник.СоставСемьи КАК СоставСемьи
		|ГДЕ
		|	СоставСемьи.УчитыватьВПлатежах = ИСТИНА";

	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
		Возврат Выборка.КоличествоЧеловек;
		
КонецФункции

#КонецОбласти


#КонецЕсли


