
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверка, существует ли платеж за этот месяц
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаЭлектроснабжения.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцДокумент,
		|	СведенияПоЭлектроснабжению.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцСведения
		|ИЗ
		|	РегистрСведений.СведенияПоЭлектроснабжению КАК СведенияПоЭлектроснабжению
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаЭлектроснабжения КАК ОплатаЭлектроснабжения
		|		ПО СведенияПоЭлектроснабжению.ОплачиваемыйМесяц = ОплатаЭлектроснабжения.ОплачиваемыйМесяц
		|ГДЕ
		|	ОплатаЭлектроснабжения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	 Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Платеж за " + ОплачиваемыйМесяц + " уже проведен";
		Сообщение.Сообщить();;	
	    Отказ = Истина;
	КонецЕсли;	
	
	// регистр СведенияПоЭлектроснабжению
	Движения.СведенияПоЭлектроснабжению.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеПлатежа Из ДанныеПлатежа Цикл
		Движение = Движения.СведенияПоЭлектроснабжению.Добавить();
		Движение.Период = Дата;
		Движение.ОплачиваемыйМесяц = ОплачиваемыйМесяц;
		Движение.ТекущиеПоказания = ТекСтрокаДанныеПлатежа.ТекущиеПоказания;
		Движение.ПоказанияНачисления = ТекСтрокаДанныеПлатежа.ПоказанияНачисления;
		Движение.СтарыеПоказания = ТекСтрокаДанныеПлатежа.СтарыеПоказания;
		Движение.Количество = ТекСтрокаДанныеПлатежа.Количество;
		Движение.Цена = ТекСтрокаДанныеПлатежа.Цена;
		Движение.Сумма = ТекСтрокаДанныеПлатежа.СуммаПлатежа;
		Движение.КодМесяцаОплаты = ОплачиваемыйМесяц.Код;
	КонецЦикла;

КонецПроцедуры
