


#Область СлужебныеПроцедурыИФункции


Процедура ВыводНаПечатьОплаты(ТабличныйДокумент, Макет, РезультатЗапроса, ОбъектыПечати) Экспорт
	
	Выборка = РезультатЗапроса.Выбрать(); 

	
	ТабличныйДокумент.Очистить();
	
	//	Формируем список ключей для структуры ДанныеЗаполненияШапка
	СписокПолей = "";
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СписокПолей = СписокПолей + ?(СписокПолей = "","",",") + Колонка.Имя;	
	КонецЦикла;
	
	//	многостраничная печать
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	
		//	ОбластьШапка
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ДанныеЗаполненияШапка = Новый Структура(СписокПолей);
		ЗаполнитьЗначенияСвойств(ДанныеЗаполненияШапка, Выборка);
		
		//	получаем стуктуру для заполнения полей Счетчика в шапке	
		ДанныеЗаполненияСчетчик = РаботаСДокументамиСервер.ПолучитьДанныеДляЗаполненияШапки(Выборка.ВидПлатежа);
		// дозаполняем 	ДанныеЗаполненияШапка из структуры ДанныеЗаполненияСчетчик	
		Для Каждого Элемент Из ДанныеЗаполненияСчетчик Цикл
			ДанныеЗаполненияШапка.Вставить(Элемент.Ключ,Элемент.Значение);
		КонецЦикла;
		
		ДанныеЗаполненияШапка.Вставить("ДатаЗаголовок",Формат(Выборка.Дата,"ДЛФ=DD;"));
		ДанныеЗаполненияШапка.Вставить("НомерЗаголовок",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер));
		
		ОбластьШапка.Параметры.Заполнить(ДанныеЗаполненияШапка);
		ТабличныйДокумент.Вывести(ОбластьШапка);
			
		//	ОбластьДанныеПлатежаШапка
		Если Выборка.ВидПлатежа = Справочники.ВидыПлатежей.Интернет 
									И Не Выборка.УчитыватьДопыИнтернет Тогда			
			ОбластьДанныеПлатежаШапка = Макет.ПолучитьОбласть("ШапкаДанныеПлатежа2");			
		Иначе
			ОбластьДанныеПлатежаШапка = Макет.ПолучитьОбласть("ШапкаДанныеПлатежа");
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьДанныеПлатежаШапка);

		//	ОбластьСтрокаДанныеПлатежа
		
		Если Выборка.ВидПлатежа = Справочники.ВидыПлатежей.Интернет 
												И Не Выборка.УчитыватьДопыИнтернет Тогда					 
			ОбластьСтрокаДанныеПлатежа = Макет.ПолучитьОбласть("СтрокаДанныеПлатежа2");							
		Иначе
			ОбластьСтрокаДанныеПлатежа = Макет.ПолучитьОбласть("СтрокаДанныеПлатежа");	
		КонецЕсли;
			
		
		РезультатДанныеПлатежа = Выборка.ДанныеПлатежа;
		//	Формируем список ключей для структуры ДанныеЗаполненияСтроки
		СписокПолейСтроки = "";
		Для Каждого Колонка Из РезультатДанныеПлатежа.Колонки Цикл
		СписокПолейСтроки = СписокПолейСтроки + ?(СписокПолейСтроки = "","",",") + Колонка.Имя;	
		КонецЦикла;
		
		ВыборкаДанныеПлатежа = РезультатДанныеПлатежа.Выбрать();
		
		Пока ВыборкаДанныеПлатежа.Следующий() Цикл
		
			
			
			ДанныеЗаполненияСтроки = Новый Структура(СписокПолейСтроки);
			ЗаполнитьЗначенияСвойств(ДанныеЗаполненияСтроки, ВыборкаДанныеПлатежа);
			ОбластьСтрокаДанныеПлатежа.Параметры.Заполнить(ДанныеЗаполненияСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрокаДанныеПлатежа);
		КонецЦикла;
		
		//	ОбластьПодвал
		Если ДанныеЗаполненияШапка.Комментарий <> "" Тогда	
			ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
			ОбластьПодвал.Параметры.Заполнить(ДанныеЗаполненияШапка);
			ТабличныйДокумент.Вывести(ОбластьПодвал);	
		КонецЕсли;
		
		//	ОбластьПлательщик
		ОбластьПлательщик = Макет.ПолучитьОбласть("Плательщик");
		
		ДанныеЗаполненияПлательщик = Новый Структура;
		ДанныеЗаполненияПлательщик.Вставить("Адрес", Константы.Адрес.Получить());
		ДанныеЗаполненияПлательщик.Вставить("Собственник", Константы.Собственник.Получить());
		
		ОбластьПлательщик.Параметры.Заполнить(ДанныеЗаполненияПлательщик);
		ТабличныйДокумент.Вывести(ОбластьПлательщик);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
            НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
