
Процедура ОбработкаПроведения(Отказ, Режим) 
	
     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаТКО.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцДокумент,
		|	СведенияПоТКО.ОплачиваемыйМесяц КАК ОплачиваемыйМесяцСведения
		|ИЗ
		|	РегистрСведений.СведенияПоТКО КАК СведенияПоТКО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаТКО КАК ОплатаТКО
		|		ПО СведенияПоТКО.ОплачиваемыйМесяц = ОплатаТКО.ОплачиваемыйМесяц
		|ГДЕ
		|	ОплатаТКО.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Платеж за " + ОплачиваемыйМесяц + " уже проведен";
		Сообщение.Сообщить();;	
	    Отказ = Истина;
	КонецЕсли;

	// регистр СведенияПоТКО
	Движения.СведенияПоТКО.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеПлатежа Из ДанныеПлатежа Цикл
		Движение = Движения.СведенияПоТКО.Добавить();
		Движение.Период = Дата;
		Движение.ОплачиваемыйМесяц = ОплачиваемыйМесяц;
		Движение.Норматив = ТекСтрокаДанныеПлатежа.Норматив;
		Движение.КоличествоЧеловек = ТекСтрокаДанныеПлатежа.КоличествоЧеловек;
		Движение.Цена = ТекСтрокаДанныеПлатежа.Цена;
		Движение.Сумма = ТекСтрокаДанныеПлатежа.СуммаПлатежа;
		Движение.КодМесяцаОплаты = ОплачиваемыйМесяц.Код;
	КонецЦикла;

КонецПроцедуры
