
Процедура ОбработкаПроведения(Отказ, Режим)
	

	// регистр ЦеныКомунальныхУслуг
	Движения.ЦеныКомунальныхУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаСписокЦен Из СписокЦен Цикл
		Движение = Движения.ЦеныКомунальныхУслуг.Добавить();
		Движение.Период = Дата;
		Движение.ВидПлатежа = ТекСтрокаСписокЦен.ВидПлатежа;
		Движение.МесяцНачалаДейсвия = МесяцНачалаДействия;
		Движение.Цена = ТекСтрокаСписокЦен.Цена;
		Движение.КодМесяца = Число(МесяцНачалаДействия.Код);
	КонецЦикла;

КонецПроцедуры
